#!/bin/sh
#
sleep 2
cd /etc/gw-redsocks/gw-shadowsocks
echo "--------------------------------成功打开dnslist文件所在目录-----------------------------------------"
rm gw-shadowsocks.dnslist
echo "---------------------------------成功删除老版本dnslist文件------------------------------------------"
curl -s -k -o gw-shadowsocks.dnslist https://g2w.online/dnsq/127.0.0.1:53535
echo "---------------------------------成功下载新版本dnslist文件------------------------------------------"
echo "                                     ****************************"
echo "又可以开心的享受无阻拦的网络啦~~~~~谢谢使用*******别忘记重启ss哟*********"
echo "                                     ****************************"
